[
  {
    "author": {
      "name": "Beth",
      "url": "https://www.budgetbytes.com/author/beth/"
    },
    "nutrition": {
      "protein": "26g",
      "fiber": "2g",
      "calories": "610kcal",
      "fat": "32g",
      "carbohydrates": "53g",
      "sodium": "787mg"
    },
    "_id": "64b06de5756c8eee1e1a4cd7",
    "imgUrl": "https://www.budgetbytes.com/wp-content/uploads/2021/12/Homemade-Mac-and-Cheese-fork-500x500.jpg",
    "name": "Homemade mac and cheese",
    "rating": "4.31 from 36 votes",
    "description": "This incredibly creamy and cheesy homemade mac and cheese is great on its own or as a jumping off point for your own creation.",
    "cookTime": "25 minutes",
    "ingredients": [
      "8 oz. macaroni",
      "3 Tbsp butter",
      "3 Tbsp all-purpose flour",
      "1/2 tsp onion powder",
      "2 cups whole milk",
      "1/2 tsp hot sauce",
      "1/2 tsp salt",
      "8 oz. block sharp cheddar, shredded"
    ],
    "instructions": [
      "Cook the macaroni according to the package directions (boil for 7-8 minutes, or until tender). Drain the macaroni in a colander.",
      "Place the butter, flour, and onion powder in a medium pot. Whisk and heat over medium until the butter is melted and the mixture begins to bubble. Once bubbling, continue to whisk and cook for one minute.",
      "After cooking the butter and flour roux, whisk in the milk. Continue to cook and whisk over medium heat until the milk begins to gently simmer, at which point it will thicken to the consistency of heavy cream or gravy.",
      "Turn the burner off. Season the white sauce with the salt and hot sauce.",
      "Begin to add the shredded cheddar, one handful at a time, whisking it in until completely melted before adding more. Continue until all of the cheese has been melted into the sauce. If the sauce becomes too cold to melt the cheese, place it back over low heat only briefly to continue melting the cheese. Overheating the sauce can cause it to break and become grainy.",
      "Add the cooked and drained pasta to the pot with the cheese sauce and stir to combine. Serve the mac and cheese hot and enjoy!"
    ],
    "equipment": [
      "Measuring cups spoons",
      "Liquid measuring cup",
      "Whisk"
    ],
    "__v": 0
  },
  {
    "author": {
      "name": "Monti",
      "url": "https://www.budgetbytes.com/author/monti/"
    },
    "nutrition": {
      "protein": "40g",
      "fiber": "2g",
      "calories": "987kcal",
      "fat": "69g",
      "carbohydrates": "51g",
      "sodium": "3208mg"
    },
    "_id": "64b06de5756c8eee1e1a4cd8",
    "imgUrl": "https://www.budgetbytes.com/wp-content/uploads/2023/06/BBQ-ribs-side-platter-500x500.jpg",
    "name": "BBQ ribs",
    "rating": "0 from 0 votes",
    "description": "You don't need a big fancy grill to get juicy, tender, fall-off-the-bone BBQ ribs. Your oven can produce lip-smackingly delicious ribs too!",
    "cookTime": "2 hours 25 minutes",
    "ingredients": [
      "3 lbs pork ribs",
      "4 Tbsp butter, melted",
      "2 tsp salt",
      "1 tsp black pepper",
      "2 tsp garlic powder",
      "2 tsp onion powder",
      "2 tsp smoked paprika",
      "1 Tbsp brown sugar",
      "2 tsp cayenne",
      "2 tsp ground mustard",
      "3 cups chicken broth",
      "1 1/2 cups BBQ sauce"
    ],
    "instructions": [
      "Place an oven rack in the center of the oven and preheat it to 300°F. Trim the ribs, removing excess fat. Trim the thicker end to even out the thickness. (Cook the trimmed meat with the ribs as a cook's bonus.) Turn the ribs over and remove the silvery membrane from the back of the ribs.",
      "Line a sheet pan that's at least 2 inches deep with heavy-duty aluminum foil and place a wire cooling rack in it. If you do not have a cooling rack, crumple a long sheet of aluminum and roll it into a rack-sized donut that is at least 2 inches thick. Place the trimmed ribs on the rack. Pat off any excess moisture with a paper towel.",
      "Make a rub by mixing salt, pepper, garlic powder, onion powder, smoked paprika, brown sugar, cayenne, ground mustard, and melted butter.",
      "Rub the seasoning generously all over the meaty top of the ribs in a thick layer.",
      "Pour chicken broth into the sheet pan, being careful not to pour it on the ribs. Place the sheet pan in the oven. Lower the temperature to 250°F. Bake uncovered for 30 minutes.",
      "Cover the ribs in aluminum foil and bake for 60 minutes, rotating the sheet pan midway through.",
      "Remove the aluminum foil and brush the ribs with 1 cup of bbq sauce. Bake for an additional 30 minutes or until tender. Every rack is different. The ribs are ready when a fork can easily pull the meat off the bone.",
      "Turn the heat in the oven on broil. Brush the ribs with an additional 1/2 cup of bbq sauce and place under the broiler for a few minutes, just until a little char develops. Remove the ribs from the oven and rest for 15 minutes. Cut the ribs to your desired size, serve, and try not to lick your fingers!"
    ],
    "equipment": [
      "Enamelware sheet Pan",
      "Wire cooling racks"
    ],
    "__v": 0
  },
  {
    "author": {
      "name": "Beth",
      "url": "https://www.budgetbytes.com/author/beth/"
    },
    "nutrition": {
      "protein": "10g",
      "fiber": "2g",
      "calories": "466kcal",
      "fat": "31g",
      "carbohydrates": "36g",
      "sodium": "546mg"
    },
    "_id": "64b25e3e47eb8764e876d53a",
    "imgUrl": "https://www.budgetbytes.com/wp-content/uploads/2023/06/BLT-Pasta-Salad-side.jpg",
    "name": "BLT PASTA SALAD",
    "rating": "4.75 from 4 votes",
    "description": "This BLT pasta salad recipe is the perfect summer meal! It's easy to make, full of flavor, and perfect for a potluck or picnic.",
    "cookTime": "25minutes mins",
    "ingredients": [
      "8 oz. bacon",
      "3/4 cup mayonnaise",
      "1/4 cup ranch dressing",
      "2 Tbsp lemon juice",
      "1/2 tsp salt",
      "1/4 tsp freshly cracked pepper",
      "12 oz. bowtie pasta",
      "1 pint grape tomatoes",
      "1/4 red onion",
      "2 cups fresh spinach (packed)"
    ],
    "instructions": [
      "Cook the bacon in a large skillet over medium heat until brown and crispy. Transfer the cooked bacon to a paper towel-lined plate to drain and cool. Once cooled, chop or crumble the bacon into smaller pieces.",
      "While the bacon is cooking, prepare the dressing. Stir together the mayonnaise, ranch dressing, lemon juice, salt, and pepper. Set the dressing aside.",
      "Bring a large pot of salted water to a boil for the pasta. Once boiling, add the pasta and cook until tender (7-8 minutes). Drain the pasta in a colander, rinse it briefly with cool water to cool it down, then let it drain very well.",
      "While the pasta is cooking and draining, prepare the vegetables. Slice the grape tomatoes in half, finely dice the red onion, and roughly chop the spinach.",
      "Once the pasta is cooled and drained, add it to a large bowl along with the spinach, tomatoes, onions, and dressing. Stir everything together until evenly combined and coated in dressing. Let the pasta sit for 10-15 minutes for the flavors to blend, then stir once more and serve."
    ],
    "equipment": [
      "Chef's knife",
      "White cutting boards",
      "Nonstick fry pans"
    ],
    "__v": 0
  }
]